{
    "main": {
        "cannotGetSettings": "Cannot find program's settings.",
        "askCreateSettings": "Create settings?",
        "createdSettings": "Settings created.\nBackups: Enabled\nBackup period: 60 secs.\nMaximum backups: 99.\nTheme: Cool Zinc",
        "askDownloadTranslation": "Cannot find translation files. Download translation files? Note: If you agree, this will install Russian translation files. If you want to start a project from scratch, disagree.",
        "downloadingTranslation": "Downloading translation files",
        "downloadedTranslation": "Translation files downloaded.",
        "startBlankProject": "Start a new project?\n(You'll get a completely empty project and start from scratch)\nYou'll have to install a translation files anyway (some of them which is unused will be deleted).",
        "whatNext": "If you want to edit an already existing translation made by me, you should download translation files when program's asking or manually download them from repository.",
        "unsavedChanges": "You have unsaved changes. Save progress and quit?",
        "originalTextIrreplacable": "Original text is irreplacable.",
        "invalidRegexp": "Invalid regular expression.",
        "textReverted": "Text was reverted to the original state",
        "reloadButton": "Reload (F5)",
        "helpButton": "Help",
        "aboutButton": "About",
        "hotkeysButton": "Hotkeys",
        "exit": "Quit without saving?",
        "fileMenu": "File",
        "helpMenu": "Help",
        "languageMenu": "Language",
        "menuButtonTitle": "Tabs (Tab)",
        "saveButtonTitle": "Save the translation files (Ctrl + S)",
        "compileButtonTitle": "Compile to JSON (Alt + C)",
        "optionsButtonTitle": "Options",
        "searchButtonTitle": "Search (Ctrl + F)",
        "searchInputTitle": "Search",
        "replaceButtonTitle": "Replace all matches with",
        "replaceInputTitle": "Replace",
        "caseButtonTitle": "Consider case (Alt + C)",
        "wholeButtonTitle": "Search the whole text (Alt + W)",
        "regexButtonTitle": "Search by regular expressions (Alt + R)",
        "translationButtonTitle": "Search only by translation (Alt + T)",
        "locationButtonTitle": "Search only in the current file (Alt + L)",
        "noMatches": "No matches",
        "currentPage": "None",
        "separator": "of",
        "goToRow": "Go to row... from 1 to"
    },
    "options": {
        "backupPeriodLabel": "Create backup every:",
        "backupPeriodNote": "seconds (min 60, max 3600)",
        "backupMaxLabel": "Max number of backups:",
        "backupMaxNote": "(min 1, max 99)",
        "backup": "Backup"
    },
    "about": {
        "version": "Version",
        "about": "Program is written all by myself.",
        "socials": "My socials:",
        "vkLink": "VK",
        "tgLink": "Telegram",
        "githubLink": "Program's GitHub",
        "license": "License"
    },
    "hotkeys": {
        "hotkeysTitle": "Hotkeys",
        "hotkeys": "Digits from \"1\" to \"+\" - Open different files to edit<br>Tab - Open the panel for selecting files<br>Ctrl + S - Save the translation files<br>Ctrl + F - Focus on the search field<br>R - Open the search panel<br>Alt + Enter - Jump to the textarea below the focused<br>Ctrl + Enter - Jump to the textarea above the focused<br>Esc - If focused element is the textarea, remove the focus, else exit from editing mode<br>Alt + C, if you are NOT focused on the textarea - Compile translation to JSON files<br>Alt + C, Alt + W, Alt + R, Alt + L, Alt + T, while you are focused on the search field - toggle case, whole text, regular expressions, only current file, and only translation text search respectively<br>LMB on the search result - scroll into the view of the result element<br>RMB on the search result - replace matching text of this element with the one that's currently entered into the replace field<br>LMB on the log result - scroll into the view of the earlier changed element<br>RMB on the log result - revert changed element to the original state<br>Ctrl + G - open the input field for jumping to specific row"
    },
    "help": {
        "helpTitle": "How to use; what to do; where to click?",
        "help": "Program is shipped without translation files, and when you launched it, you can either select to download them or create a new project.<br>Program regularly creates backups of translation files in \"res/backups\" path, period of backup and max number of backups can be controlled in the options. By default, the program creates backups every 60 seconds.<br>When you're saving changes in the program, all translation files will be written in the \"res/translation\" folder. If you want to use your own translation files in the program, just put them into this folder.<br>To save your project changes, just press the save button or use Ctrl + S shortcut. It will automatically save your project, and when you start the program again, you can continue from where you left off.<br> To compile your translation into game's JSON files, just press the compile button or use Alt + C shortcut. Make sure to save before you compile your translation. It will create fully functional JSON files in the \"res/data\" folder.<br>You can read this manual again or get help about program's hotkeys by selecting \"About\" and \"Hotkeys\" top menu options respectively."
    }
}
