{
    "main": {
        "cannotGetSettings": "Не удалось найти файл настроек программы.",
        "askCreateSettings": "Создать настройки?",
        "createdSettings": "Настройки созданы.\nРезервное копирование: Включено\nПериод копирования: 60 сек.\nМаксимальное число копий: 99.\nТема: Классный цинк",
        "unsavedChanges": "У вас остались несохранённые изменения. Сохранить прогресс и выйти?",
        "originalTextIrreplacable": "Оригинальные строки не могут быть заменены.",
        "invalidRegexp": "Некорректное регулярное выражение",
        "textReverted": "Текст был возвращён к исходному значению",
        "reloadButton": "Перезагрузить (F5)",
        "helpButton": "Помощь",
        "aboutButton": "О программе",
        "hotkeysButton": "Горячие клавиши",
        "exit": "Выйти без сохранения?",
        "fileMenu": "Файл",
        "helpMenu": "Помощь",
        "languageMenu": "Язык",
        "menuButtonTitle": "Вкладки (Tab)",
        "saveButtonTitle": "Сохранить файлы перевода (Ctrl + S)",
        "compileButtonTitle": "Скомпилировать в JSON файлы (Alt + C)",
        "optionsButtonTitle": "Настройки",
        "searchButtonTitle": "Поиск (Ctrl + F)",
        "searchInputTitle": "Поиск",
        "replaceButtonTitle": "Заменить все совпадения на",
        "replaceInputTitle": "Замена",
        "caseButtonTitle": "Учитывать регистр (Alt + C)",
        "wholeButtonTitle": "Искать слова целиком (Alt + W)",
        "regexButtonTitle": "Поиск по регулярным выражениям (Alt + R)",
        "translationButtonTitle": "Поиск только по переводу (Alt + T)",
        "locationButtonTitle": "Поиск только в текущем файле (Alt + L)",
        "noMatches": "Нет совпадений",
        "currentPage": "Нет",
        "separator": "из",
        "goToRow": "Перейти к строке... от 1 до",
        "missingTranslationDir": "Директория \"translation\" отсутствует. Проект не будет инициализирован.",
        "missingOriginalDir": "Директория \"original\" отсутствует. Проект не будет инициализирован.",
        "missingTranslationSubdirs": "Поддиректории \"maps\", \"other\" и \"plugins\" директории \"translation\" отсутствуют. Проект не будет инициализирован.",
        "noProjectSelected": "Проект не выбран. Выберите директорию проекта, используя кнопку \"открыть папку\" в левом верхнем углу. Директория должна содержать в себе папки \"original\" и \"translation\" (с поддиректориями \"maps\", \"other\" и \"plugins\", если это RPG Maker MV или RPG Maker MZ, или \"maps\" и \"other\", если это RPG Maker XP, VX, VX Ace)."
    },
    "options": {
        "backupPeriodLabel": "Создавать резервные копии каждые:",
        "backupPeriodNote": "секунд (минимум 60, максимум 3600)",
        "backupMaxLabel": "Максимальное количество резервных копий:",
        "backupMaxNote": "(минимум 1, максимум 99)",
        "backup": "Резервное копирование"
    },
    "about": {
        "version": "Версия",
        "about": "Программа написана собственноручно мной.",
        "socials": "Мои соцсети:",
        "vkLink": "ВК",
        "tgLink": "Телеграм",
        "githubLink": "GitHub программы",
        "license": "Лицензия"
    },
    "hotkeys": {
        "hotkeysTitle": "Горячие клавиши",
        "hotkeys": "Цифры от 1 до + - Редактирование разных файлов<br>Tab - Открыть панель выбора файлов<br>Ctrl + S - Сохранить файлы перевода<br>Ctrl + F - Навестись на строку поиска<br>R - Открыть панель поиска<br>Alt + Enter - Перепрыгнуть на нижнее текстовое поле<br>Ctrl + Enter - Перепрыгнуть на верхнее текстовое поле<br>Esc - Если курсор сфокусирован на текстовом поле, убрать фокусировку на текстовом поле; иначе, выйти из состояния редактирования файлов<br>Alt + C, пока вы НЕ наведены на поле ввода текста - Скомпилировать в JSON файлы<br>Alt + C, Alt + W, Alt + R, Alt + L, Alt + T, пока вы наведены на поле ввода текста для поиска - переключить поиск по регистру, по словам целиком, по регулярным выражением, по текущему файлу, и только по переводу соответственно<br>ЛКМ на результате поиска - перейти к найденному элементу<br>ПКМ на результате поиска - заменить текст этого элемента на тот, что в данный момент введён в поле<br>ЛКМ на результате журнала - перейти к изменённому ранее элементу<br>ПКМ на результате журнала - вернуть изменённый элемент в предыдущее состояние<br>Ctrl + G - открыть поле для ввода числа линии, на которую вы хотите перейти"
    },
    "help": {
        "helpTitle": "Как пользоваться; что делать; куда нажимать?",
        "help": "Программа поставляется без файлов перевода, и когда вы впервые запустите ее, вы можете либо загрузить их, либо создать новый проект. Программа регулярно создает резервные копии файлов переводов по пути \"res/backups\", период резервного копирования и максимальное количество резервных копий можно регулировать в настройках. По умолчанию программа создает резервные копии каждые 60 секунд.<br>При сохранении перевода в программе, все файлы перевода будут сохранятся по пути \"res/translation\". Если вы хотите использовать в программе свои собственные файлы перевода, просто поместите их в эту папку.<br>Чтобы сохранить изменения в проекте, просто нажмите кнопку сохранить или используйте сочетание клавиш Ctrl + S. Программа автоматически сохранит ваш проект, и когда вы снова запустите программу, вы сможете продолжить с того места, на котором остановились.<br>Чтобы скомпилировать ваш перевод в JSON-файлы игры, просто нажмите кнопку компиляции или используйте сочетание клавиш Alt + C. Обязательно сохраните перевод перед компиляцией. Программа создаст полностью функциональные файлы JSON в папке \"res/data\".<br>Вы можете еще раз прочитать это руководство или получить справку о горячих клавишах программы, выбрав пункты верхнего меню \"О программе\" и \"Горячие клавиши\" соответственно."
    }
}
